Documents/ПереводОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПереводОбучающихся</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальностьКонтингента</xr:Item>
				<xr:Item>AccumulationRegister.ЧисленностьГруппы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Абитуриенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПереводОбучающихся/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПереводОбучающихся.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереводОбучающихся.Автор,
	|	ПереводОбучающихся.Дата,
	|	ПереводОбучающихся.Номер,
	|	ПереводОбучающихся.Абитуриенты.(
	|		НомерСтроки,
	|		ФИО,
	|		СтараяГруппа,
	|		НоваяГруппа,
	|		Причина
	|	)
	|ИЗ
	|	Документ.ПереводОбучающихся КАК ПереводОбучающихся
	|ГДЕ
	|	ПереводОбучающихся.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьАбитуриентыШапка = Макет.ПолучитьОбласть("АбитуриентыШапка");
	ОбластьАбитуриенты = Макет.ПолучитьОбласть("Абитуриенты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьАбитуриентыШапка);
		ВыборкаАбитуриенты = Выборка.Абитуриенты.Выбрать();
		Пока ВыборкаАбитуриенты.Следующий() Цикл
			ОбластьАбитуриенты.Параметры.Заполнить(ВыборкаАбитуриенты);
			ТабДок.Вывести(ОбластьАбитуриенты, ВыборкаАбитуриенты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
